# APP
package = 'ru.limeshop.android.dev'
# package = 'ru.limeshop.android'
app_link = 'app_link'

# Reg valid data
valid_name_lat = "Ivan"
valid_surname_lat = 'Ivanov'
valid_name_kir = "Иван"
valid_surname_kir = 'Иванов'
valid_password = 'Qwerty1'
valid_email = 'tester23n@lime.com'
valid_phone = '9639447845'
subscribe = ['WOMEN', 'KIDS']
checkboxes = ['WOMEN', 'MEN', 'KIDS']

# Промокоды (купоны):
promo_code_1 = 'LIMEPR'  # спец купон для блоггеров, 0% скидка, просто чтобы передалось везде что это блоггер
promo_code_2 = 'SOTRUDN25'  # скидка 25% для сотрудников
promo_code_3 = 'XHGFAH'  # скидка 10%

# Номер карты                   Тип		                        Результат оплаты	Результат оплаты по токену
card_1 = 4242424242424242  # Карта Visa с 3-D Secure		    Успешный результат	Успешный результат
card_2 = 5555555555554444  # Карта Mastercard с 3-D Secure	    Успешный результат	Успешный результат
card_3 = 2200000000000004  # Карта МИР с 3-D Secure		        Успешный результат	Успешный результат
card_4 = 4012888888881881  # Карта Visa с 3-D Secure		    Недостаточно средств на карте
card_5 = 5105105105105100  # Карта Mastercard с 3-D Secure	    Недостаточно средств на карте
card_6 = 2202202202202200  # Карта МИР с 3-D Secure		        Недостаточно средств на карте
card_7 = 4000000000003055  # Карта Visa без 3-D Secure		    Успешный результат	Успешный результат
card_8 = 5205000000003055  # Карта Mastercard без 3-D Secure	Успешный результат	Успешный результат
card_9 = 2202000000003055  # Карта МИР без 3-D Secure		    Успешный результат	Успешный результат
card_10 = 4111111111111111  # Карта Visa без 3-D Secure		    Успешный результат	Недостаточно средств на карте
card_11 = 5200828282828210  # Карта Mastercard без 3-D Secure	Успешный результат	Недостаточно средств на карте
card_12 = 2200000022222222  # Карта МИР без 3-D Secure		    Успешный результат	Недостаточно средств на карте
card_13 = 4000056655665556  # Карта Visa без 3-D Secure		    Недостаточно средств на карте
card_14 = 5404000000000043  # Карта Mastercard без 3-D Secure	Недостаточно средств на карте
card_15 = 2203000000000043  # Карта МИР без 3-D Secure		    Недостаточно средств на карте
